Revit 2027 API
EnergyDataSettings.CheckExportCategory Method
 Checks whether the export category falls within the list:
OST_Rooms
OST_MEPSpaces
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckExportCategory(
	ElementId exportCategoryId
)
Public Shared Function CheckExportCategory (
	exportCategoryId As ElementId
) As Boolean
public:
static bool CheckExportCategory(
	ElementId^ exportCategoryId
)
static member CheckExportCategory :
        exportCategoryId : ElementId -> bool
Parameters
exportCategoryId ElementId
 The export category to be checked.
Return Value
Boolean
 True if the export category falls within the list, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace